presslab-us/ZigBee_SensorTag2/WeatherStation/CC2650/scif/scif_framework.c
    // Perform sanity checks: The Sensor Controller cannot already be active
    if (HWREG(AON_WUC_BASE + AON_WUC_O_AUXCTL) & AON_WUC_AUXCTL_SCE_RUN_EN_M) {
        return SCIF_ILLEGAL_OPERATION;
    }

    // Copy the driver setup
    memcpy(&scifData, pScifDriverSetup, sizeof(SCIF_DATA_T));

    // Enable clock for required AUX modules
    HWREG(AUX_WUC_BASE + AUX_WUC_O_MODCLKEN0) = AUX_WUC_MODCLKEN0_SMPH_M |
                                                AUX_WUC_MODCLKEN0_AIODIO0_M |
                                                AUX_WUC_MODCLKEN0_AIODIO1_M |
                                                AUX_WUC_MODCLKEN0_TIMER_M |
                                                AUX_WUC_MODCLKEN0_ANAIF_M |
                                                AUX_WUC_MODCLKEN0_TDC_M |
                                                AUX_WUC_MODCLKEN0_AUX_DDI0_OSC_M |
                                                AUX_WUC_MODCLKEN0_AUX_ADI4_M;

    // Open the AUX I/O latches, which have undefined value after power-up. AUX_AIODIO will by default
    // drive '0' on all I/O pins, so AUX_AIODIO must be configured before IOC
    HWREG(AUX_WUC_BASE + AUX_WUC_O_AUXIOLATCH) = AUX_WUC_AUXIOLATCH_EN_TRANSP;

    // Upload the AUX RAM image
    memcpy((void*) AUX_RAM_BASE, scifData.pAuxRamImage, scifData.auxRamImageSize);

    // Perform task resource initialization
    scifData.fptrTaskResourceInit();

    // Map events to the Sensor Controller's vector table, and set reset vector = AON wakeup
    HWREG(AUX_EVCTL_BASE + AUX_EVCTL_O_VECCFG0) = AUX_EVCTL_VECCFG0_VEC0_EV_AON_SW      | AUX_EVCTL_VECCFG0_VEC0_EN_M |
                                                  AUX_EVCTL_VECCFG0_VEC1_EV_AON_RTC_CH2 | AUX_EVCTL_VECCFG0_VEC1_EN_M;
    HWREG(AUX_EVCTL_BASE + AUX_EVCTL_O_VECCFG1) = AUX_EVCTL_VECCFG1_VEC2_EV_AON_SW      | AUX_EVCTL_VECCFG1_VEC2_EN_M |
                                                  AUX_EVCTL_VECCFG1_VEC3_EV_AON_SW;
    HWREG(AUX_SCE_BASE + AUX_SCE_O_CTL) = 1 << AUX_SCE_CTL_RESET_VECTOR_S;

    // Clear any vector flags currently set (due to previous hardware or SCIF driver operation)
    HWREG(AUX_EVCTL_BASE + AUX_EVCTL_O_VECFLAGS) = 0x0000;

    // Set the READY event
    HWREG(AUX_EVCTL_BASE + AUX_EVCTL_O_SWEVSET) = AUX_EVCTL_SWEVSET_SWEV0_M;

    // Let AUX be powered down (clocks disabled, full retention) and the bus connection between the AUX
    // and MCU domains be disconnected by default. This may have been done already by the operating
    // system to be able to avoid framework dependencies on whether or not the Sensor Controller is used.
    HWREG(AUX_WUC_BASE + AUX_WUC_O_PWRDWNREQ) = 1;
    HWREG(AUX_WUC_BASE + AUX_WUC_O_MCUBUSCTL) = AUX_WUC_MCUBUSCTL_DISCONNECT_REQ;

    // Start the Sensor Controller, but first read a random register from the AUX domain to ensure
    // that the last write accesses have been completed
    HWREG(AUX_WUC_BASE + AUX_WUC_O_MCUBUSCTL);
    key = scifOsalEnterCriticalSection();
    HWREG(AON_WUC_BASE + AON_WUC_O_AUXCTL) |= AON_WUC_AUXCTL_SCE_RUN_EN_M;

    // The System CPU shall wake up on the ALERT event
    HWREG(AON_EVENT_BASE + AON_EVENT_O_MCUWUSEL) =
        (HWREG(AON_EVENT_BASE + AON_EVENT_O_MCUWUSEL) & ~(AON_EVENT_MCUWUSEL_WU0_EV_M << OSAL_MCUWUSEL_WU_EV_S)) |
        (AON_EVENT_MCUWUSEL_WU0_EV_AUX_SWEV1 << OSAL_MCUWUSEL_WU_EV_S);
    scifOsalLeaveCriticalSection(key);
    HWREG(AON_RTC_BASE + AON_RTC_O_SYNC);

    // Register and enable the interrupts. If warm, we probably have task ALERT event(s) pending, which
    // will be triggered immediately. We need to clear the interrupts because they might have been used
    // previously
    osalRegisterCtrlReadyInt();
    osalClearCtrlReadyInt();
    osalEnableCtrlReadyInt();
    osalRegisterTaskAlertInt();
    osalClearTaskAlertInt();
    osalEnableTaskAlertInt();

    return SCIF_SUCCESS;

} // scifInit




/** \brief Uninitializes the driver in order to release hardware resources or switch to another driver
  *
  * All Sensor Controller tasks must have been stopped before calling this function, to avoid leaving
  * hardware modules used in an unknown state. Also, any tick generation must have been stopped to avoid
  * leaving handshaking with the tick source in an unknown state.
  *
  * This function will wait until the Sensor Controller is sleeping before shutting it down.
  */
void scifUninit(void) {
    uint32_t key;

    // Wait until the Sensor Controller is idle (it might still be running, though not for long)
    while (!(HWREG(AUX_SCE_BASE + AUX_SCE_O_CPUSTAT) & AUX_SCE_CPUSTAT_SLEEP_M));

    // Stop and reset the Sensor Controller Engine
    HWREG(AUX_SCE_BASE + AUX_SCE_O_CTL) = AUX_SCE_CTL_RESTART_M;
    HWREG(AUX_SCE_BASE + AUX_SCE_O_CTL) = AUX_SCE_CTL_RESTART_M | AUX_SCE_CTL_SUSPEND_M;
    HWREG(AUX_SCE_BASE + AUX_SCE_O_CTL);
    key = scifOsalEnterCriticalSection();
    HWREG(AON_WUC_BASE + AON_WUC_O_AUXCTL) &= ~AON_WUC_AUXCTL_SCE_RUN_EN_M;
    scifOsalLeaveCriticalSection(key);
    HWREG(AON_RTC_BASE + AON_RTC_O_SYNC);
    HWREG(AUX_SCE_BASE + AUX_SCE_O_CTL) = 0x0000;

    // Disable interrupts
    osalDisableCtrlReadyInt();
    osalDisableTaskAlertInt();

    // Perform task resource uninitialization
    scifData.fptrTaskResourceUninit();

} // scifUninit




/** \brief Returns a bit-vector indicating the ALERT events associcated with the last ALERT interrupt
  *
  * This function shall be called by the application after it has received an ALERT interrupt, to find
  * which events have occurred.
  *
  * When all the alert events have been handled, the application must call \ref scifAckAlertEvents().
  * After acknowledging, this function must not be called again until the next ALERT event has been
  * received.
  *
  * \return
  *     The event bit-vector contains the following fields:
  *     - [23:16] Normal task completion, without error, one bit per task ID
  *     - [15:8] Task input/output handling failed due to underflow/overflow, one bit per task ID
  *     - [7:0] Task input/output data exchange pending, one bit per task ID
  */
uint32_t scifGetAlertEvents(void) {
    uint32_t bvTaskIoAlert = scifData.pTaskCtrl->bvTaskIoAlert;
    return (scifData.pTaskCtrl->bvTaskDoneAlert << 16) | bvTaskIoAlert;
} // scifGetAlertEvents




/** \brief Clears the ALERT interrupt source
  *
  * The application must call this function once and only once after reception of an ALERT interrupt,
  * before calling \ref scifAckAlertEvents().
  */
void scifClearAlertIntSource(void) {

    // Clear the source
    HWREG(AUX_EVCTL_BASE + AUX_EVCTL_O_EVTOAONFLAGSCLR) = AUX_EVCTL_EVTOAONFLAGS_SWEV1_M;

